commons/ihe/xacml20/src/main/resources/wsdl/ch-adr.wsdl

<?xml version="1.0" encoding="utf-8"?>
<!--
  ~ Copyright 2023 the original author or authors.
  ~
  ~ Licensed under the Apache License, Version 2.0 (the "License");
  ~ you may not use this file except in compliance with the License.
  ~ You may obtain a copy of the License at
  ~
  ~         http://www.apache.org/licenses/LICENSE-2.0
  ~
  ~  Unless required by applicable law or agreed to in writing, software
  ~  distributed under the License is distributed on an "AS IS" BASIS,
  ~  WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
  ~  See the License for the specific language governing permissions and
  ~  limitations under the License.
  -->
<definitions name="AuthorizationDecisionsManager"
             xmlns="http://schemas.xmlsoap.org/wsdl/"
             targetNamespace="urn:ihe:iti:2014:ser"
             xmlns:ser="urn:ihe:iti:2014:ser"
             xmlns:samlp="urn:oasis:names:tc:SAML:2.0:protocol"
             xmlns:xacml-samlp="urn:oasis:names:tc:xacml:2.0:profile:saml2.0:v2:schema:protocol"
             xmlns:wsam="http://www.w3.org/2007/05/addressing/metadata"
             xmlns:soap12="http://schemas.xmlsoap.org/wsdl/soap12/"
             xmlns:xsd="http://www.w3.org/2001/XMLSchema">

    <documentation>Authorization Decisions Manager, transaction ITI-79 "Authorization Decisions Query"</documentation>

    <types>
        <xsd:schema targetNamespace="urn:oasis:names:tc:xacml:2.0:profile:saml2.0:v2:schema:protocol">
            <xsd:include schemaLocation="../schema/xacml-2.0-profile-saml2.0-v2-schema-protocol-wd-14.xsd"/>
        </xsd:schema>
        <xsd:schema targetNamespace="urn:oasis:names:tc:SAML:2.0:protocol">
            <xsd:include schemaLocation="../schema/sstc-saml-schema-protocol-2.0.xsd"/>
        </xsd:schema>
        <xsd:schema targetNamespace="urn:hl7-org:v3">
            <xsd:include schemaLocation="../schema/ihe-appc-xacml-hl7-datatypes-base-1.0.xsd"/>
        </xsd:schema>
    </types>

    <message name="AuthorizationDecisionsQuery_Message">
        <part name="body" element="xacml-samlp:XACMLAuthzDecisionQuery"/>
    </message>
    <message name="AuthorizationDecisionsQuery_ResponseMessage">
        <part name="body" element="samlp:Response"/>
    </message>

    <portType name="AuthorizationDecisionsManager_PortType">
        <operation name="AuthorizationDecisionsManager_AuthorizationDecisionsQuery">
            <input message="ser:AuthorizationDecisionsQuery_Message"
                   wsam:Action="urn:e-health-suisse:2015:policy-enforcement:AuthorizationDecisionRequest"/>
            <output message="ser:AuthorizationDecisionsQuery_ResponseMessage"
                    wsam:Action="urn:e-health-suisse:2015:policy-enforcement:XACMLAuthzDecisionResponse"/>
        </operation>
    </portType>

    <binding name="AuthorizationDecisionsManager_Binding_Soap12" type="ser:AuthorizationDecisionsManager_PortType">
        <soap12:binding style="document" transport="http://schemas.xmlsoap.org/soap/http"/>
        <operation name="AuthorizationDecisionsManager_AuthorizationDecisionsQuery">
            <soap12:operation soapActionRequired="false"/>
            <input>
                <soap12:body use="literal"/>
            </input>
            <output>
                <soap12:body use="literal"/>
            </output>
        </operation>
    </binding>

    <service name="AuthorizationDecisionsManager_Service">
        <port name="AuthorizationDecisionsManager_Port_Soap12" binding="ser:AuthorizationDecisionsManager_Binding_Soap12">
            <soap12:address location="https://authorization-decisions-manager/iti79"/>
        </port>
    </service>
</definitions>

